podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/MSCM_S32K14x.svd.xml
<!--
Devices using this peripheral: 
      S32K142
      S32K144
      S32K146
      S32K148
-->
      <peripheral>
         <?sourceFile "MSCM_S32K14x" ?>
         <name>MSCM</name>
         <description>MSCM</description>
         <groupName>MSCM</groupName>
         <headerStructName>MSCM</headerStructName>
         <baseAddress>0x40001000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x40</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x400</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CPxTYPE</name>
               <description>Processor X Type Register</description>
               <addressOffset>0x0</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>RYPZ</name>
                     <description>Processor x Revision</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PERSONALITY</name>
                     <description>Processor x Personality</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPxNUM</name>
               <description>Processor X Number Register</description>
               <addressOffset>0x4</addressOffset>
               <access>read-only</access>
               <resetMask>0xFFFFFFFE</resetMask>
               <fields>
                  <field>
                     <name>CPN</name>
                     <description>Processor x Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPxMASTER</name>
               <description>Processor X Master Register</description>
               <addressOffset>0x8</addressOffset>
               <access>read-only</access>
               <resetMask>0xFFFFFFC0</resetMask>
               <fields>
                  <field>
                     <name>PPMN</name>
                     <description>Processor x Physical Master Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPxCOUNT</name>
               <description>Processor X Count Register</description>
               <addressOffset>0xC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PCNT</name>
                     <description>Processor Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPxCFG0</name>
               <description>Processor X Configuration Register 0</description>
               <addressOffset>0x10</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>DCWY</name>
                     <description>Level 1 Data Cache Ways</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DCSZ</name>
                     <description>Level 1 Data Cache Size</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ICWY</name>
                     <description>Level 1 Instruction Cache Ways</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ICSZ</name>
                     <description>Level 1 Instruction Cache Size</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPxCFG1</name>
               <description>Processor X Configuration Register 1</description>
               <addressOffset>0x14</addressOffset>
               <access>read-only</access>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>L2WY</name>
                     <description>Level 2 Instruction Cache Ways</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>L2SZ</name>
                     <description>Level 2 Instruction Cache Size</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPxCFG2</name>
               <description>Processor X Configuration Register 2</description>
               <addressOffset>0x18</addressOffset>
               <access>read-only</access>
               <resetValue>0x10001</resetValue>
               <resetMask>0xFF00FF</resetMask>
               <fields>
                  <field>
                     <name>TMUSZ</name>
                     <description>Tightly-coupled Memory Upper Size</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TMLSZ</name>
                     <description>Tightly-coupled Memory Lower Size</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPxCFG3</name>
               <description>Processor X Configuration Register 3</description>
               <addressOffset>0x1C</addressOffset>
               <access>read-only</access>
               <resetMask>0xFFFFFC80</resetMask>
               <fields>
                  <field>
                     <name>FPU</name>
                     <description>Floating Point Unit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>FPU support is not included</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>FPU support is included</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIMD</name>
                     <description>SIMD/NEON instruction support</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>SIMD/NEON support is not included</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>SIMD/NEON support is included</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>JAZ</name>
                     <description>Jazelle support</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Jazelle support is not included</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Jazelle support is included</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MMU</name>
                     <description>Memory Management Unit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>MMU support is not included</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>MMU support is included</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TZ</name>
                     <description>Trust Zone</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Trust Zone support is not included</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Trust Zone support is included</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMP</name>
                     <description>Core Memory Protection unit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Core Memory Protection is not included</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Core Memory Protection is included</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BB</name>
                     <description>Bit Banding</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Bit Banding is not supported</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Bit Banding is supported</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SBP</name>
                     <description>System Bus Ports</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CP0TYPE</name>
               <description>Processor 0 Type Register</description>
               <addressOffset>0x20</addressOffset>
               <access>read-only</access>
               <resetValue>0x434D3401</resetValue>
               <fields>
                  <field>
                     <name>RYPZ</name>
                     <description>Processor 0 Revision</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PERSONALITY</name>
                     <description>Processor 0 Personality</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CP0NUM</name>
               <description>Processor 0 Number Register</description>
               <addressOffset>0x24</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CPN</name>
                     <description>Processor 0 Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CP0MASTER</name>
               <description>Processor 0 Master Register</description>
               <addressOffset>0x28</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PPMN</name>
                     <description>Processor 0 Physical Master Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CP0COUNT</name>
               <description>Processor 0 Count Register</description>
               <addressOffset>0x2C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PCNT</name>
                     <description>Processor Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CP0CFG0</name>
               <description>Processor 0 Configuration Register 0</description>
               <addressOffset>0x30</addressOffset>
               <access>read-only</access>
               <resetValue>0x4000000</resetValue>
               <fields>
                  <field>
                     <name>DCWY</name>
                     <description>Level 1 Data Cache Ways</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DCSZ</name>
                     <description>Level 1 Data Cache Size</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ICWY</name>
                     <description>Level 1 Instruction Cache Ways</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ICSZ</name>
                     <description>Level 1 Instruction Cache Size</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CP0CFG1</name>
               <description>Processor 0 Configuration Register 1</description>
               <addressOffset>0x34</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>L2WY</name>
                     <description>Level 2 Instruction Cache Ways</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>L2SZ</name>
                     <description>Level 2 Instruction Cache Size</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CP0CFG2</name>
               <description>Processor 0 Configuration Register 2</description>
               <addressOffset>0x38</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TMUSZ</name>
                     <description>Tightly-coupled Memory Upper Size</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TMLSZ</name>
                     <description>Tightly-coupled Memory Lower Size</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
